#include "../../inc/quick_seed_finder.h"
#include <corecrt.h>
#include <cstdint>
#include <iostream>

Scene my_scene = ROOF;
std::string file_name = "../../data/RE.bin";
uint64_t find_len = 0xffffffff;
// 24,25,旗帜僵博

void load_data(){
    std::ifstream file(file_name, std::ios::binary);
    if (file.is_open()) {
        file.read(reinterpret_cast<char*>(array), array_size * sizeof(uint32_t));
        if (!file) std::cerr << "Error reading file. Only " << file.gcount() << " could be read." << std::endl;
        file.close();
    } else std::cerr << "Unable to open file for reading." << std::endl;
    printf("LOAD END\n");
}
// 指定出怪种子寻找
void test_kmp(){
    load_data();
	final_results.clear();

    MultiQuickKMPFinder finder(0,uint64_t(find_len),my_scene,{
        509979,	502035,	58413
        // 灯笼 55665  509979	502035	58413
        //炽热3190F6E4 无神 15258,	355416,	205630,
        //灯笼 群曾 467983	,336955	,221455
        /*
            老手
            两仪400f
            2222-2322:  2224:   70899   435013  13227   
            2322-2422:  2324:   350403	492059	361767  2A5CDED2

            老手
            两仪100f
                2224 66447	291399	203343
        */
        //煎饺 9998-10004，224712	468073	407177
        /*  灯笼 
            杂交 255017	,116789	,109881,        1255635695, 4AD6FFC9 624f-670f
            55665  280859	378117	475449 ; 7A5D771  2022-2188f        
            斜梯 353321,	491803,	501783; 39B83561 2022-2100; 红36/69(21-28) 桶40/69(57-66) 丑30/69(2)
        */
        /*  浮华 
            凛冬: 
            D16C49E3 2000-2060 | 498757,493611,430151,;
            2823FC50 2060-2090 | 503849,401786,268591,;
            F5B057E5 2090-2150 | 100469	,292156	,475189
        */
    });

    finder.multi_thread_find_kmp();

    if(final_results.empty() || final_results[0].seeds.size()==0){
        printf("NOT FOUND\n");
        return;
    }
    printf("FOUND\n");
    finder.show_results(final_results, 1, 13, my_scene, 1112, 5);
    finder.output_csv("output.csv", final_results);
}
// 按分数寻种+种子难度分析
void test_score(){
    load_data();

	final_results.clear();
    MultiQuickScoreSeedFinder finder(0,uint64_t(find_len),50,my_scene,
    {
        AHY_32, AXC_15, AQQ_16, AFT_21        
    },
    {
        1, 1, 1, 1,
    });
    finder.multi_thread_find_score();
    finder.show_results(final_results, 1, 13, my_scene, 1000, 9);
    finder.output_csv("output.csv", final_results);

    
    size_t num=0;
    
    int std_metric = 9;
    for(auto info:final_results){
        if(info.metric==std_metric)
            std::cout<<num<<',';
        num+=info.seed_count;
        if(info.metric==std_metric)
            std::cout<<num<<',';
    }
    
    std::cout<<num<<'\n';
    std::cout<<final_results.size()<<'\n';

    std::cout<<final_results[final_results.size()-1].metric<<'\n';
}
// 按连续关寻种+连续关长度可能性
void test_continue(){
    load_data();

	final_results.clear();
    MultiQuickContinueSeedFinder finder(0,uint64_t(find_len),my_scene,
    {
        {AHY_32, AXC_15, AKG_17}
    },
    {
        {ATT_4, ATM_6, ABY_23}
    });
    finder.multi_thread_find_continue();
    finder.show_results(final_results, 1, 13, my_scene, 1000, 25);
    finder.output_csv("output.csv", final_results);

    std::ofstream file("num.csv");

    size_t num=0;
    for(int i=final_results.size()-1;i>=0;i--){
        auto info = final_results[i];
        file<<info.metric;
        num += info.seed_count;
        file<<",";

        file<<info.seed_count;

        file<<",";

        file<<num;
        file<<'\n';    
    }
    file.close();

    //std::cout<<final_results.size()<<'\n';
    //std::cout<<final_results[final_results.size()-1].metric<<'\n';
}
// 按试验矩阵寻种
void test_set(){
    load_data();
	final_results.clear();
    MultiQuickSetFinder finder(0,uint64_t(find_len),my_scene,        
        0b101100000100100100000
        ,{
        0b101100000100100100000,
        0b100000000100100100000,
        });

    /*  ME 2 32 正交 红橄白车气 密度
        0b101100000100100100000
        ,{
            0b000000000000000000000,
            0b000000000000100100000,
            0b000000000100000100000,
            0b000000000100100000000,
            0b000100000000000100000,
            0b000100000000100000000,
            0b000100000100000000000,
            0b000100000100100100000,
            0b001000000000000100000,
            0b001000000000100000000,
            0b001000000100000000000,
            0b001000000100100100000,
            0b001100000000000000000,
            0b001100000000100100000,
            0b001100000100000100000,
            0b001100000100100000000,
            0b100000000000000100000,
            0b100000000000100000000,
            0b100000000100000000000,
            0b100000000100100100000,
            0b100100000000000000000,
            0b100100000000100100000,
            0b100100000100000100000,
            0b100100000100100000000,
            0b101000000000000000000,
            0b101000000000100100000,
            0b101000000100000100000,
            0b101000000100100000000,
            0b101100000000000100000,
            0b101100000000100000000,
            0b101100000100000000000,
            0b101100000100100100000,
        }
    */

    /*  N6E 68 32正交       
        0b101110000100001100010
        ,{
            0b001010000000000000000,
            0b001000000000000100010,
            0b000000000100000000010,
            0b000010000100000100010,
            0b000000000000001100000,
            0b001010000100001100000,
            0b001000000100001000010,
            0b000010000000001000010,
            0b001100000100000000000,
            0b000110000000000000000,

            0b000110000000000100000,
            0b001110000000000100000,
            0b000100000100001000000,
            0b000100000100001100010,
            0b001100000100001100010,
            0b001110000000001000010,
            0b101000000100000100000,
            0b100010000100000000000,
            0b100000000000000100010,
            0b101010000100000000010,

            0b100000000000001000000,
            0b101000000000001000000,
            0b100010000100001100000,
            0b101010000000001100010,
            0b100100000100000100000,
            0b100100000000000000010,
            0b101100000000000000010,
            0b101110000100000100010,
            0b101100000000001100000,
            0b101110000100001000000,

            0b100110000000001100010,
            0b100110000100001000010,
        //      0b101110000100001100010,
        }
    */

    /*  N6E 掌单花 32正交
        0b101100000000001100010
        ,{
            0b000000000000000000000,
            0b001000000000001000000,
            0b000000000000001100000,
            0b001000000000000100000,
            0b000000000000001000010,
            0b001000000000000000010,
            0b000000000000000100010,
            0b001000000000001100010,

            0b000100000000001000000,
            0b001100000000000000000,
            0b000100000000000100000,
            0b001100000000001100000,
            0b000100000000000000010,
            0b001100000000001000010,
            0b000100000000001100010,
            0b001100000000000100010,

            0b100000000000001000000,
            0b101000000000000000000,
            0b100000000000000100000,
            0b101000000000001100000,
            0b100000000000000000010,
            0b101000000000001000010,
            0b100000000000001100010,
            0b101000000000000100010,

            0b100100000000000000000,
            0b101100000000001000000,
            0b100100000000001100000,
            0b101100000000000100000,
            0b100100000000001000010,
            0b101100000000000000010,
            0b100100000000000100010,
            0b101100000000001100010,
    */

    /*  DE 半花
        0b101100000100101100010
        ,{
        0b000000000000000000000,
        0b100100000000001000000,
        0b000000000100001000010,
        0b100100000100000000010,
        0b100000000000101000000,
        0b000100000000100000000,
        0b100000000100100000010,
        0b000100000100101000010,
        0b000000000000001100010,

        0b100100000000000100010,
        0b000000000100000100000,
        0b100100000100001100000,
        0b100000000000100100010,
        0b000100000000101100010,
        0b100000000100101100000,
        0b000100000100100100000,
        0b101000000000001000010,

        0b001100000000000000010,
        0b101000000100000000000,
        0b001100000100001000000,
        0b001000000000100000010,
        0b101100000000101000010,
        0b001000000100101000000,
        0b101100000100100000000,
        0b101000000000000100000,

        0b001100000000001100000,
        0b101000000100001100010,
        0b001100000100000100010,
        0b001000000000101100000,
        0b101100000000100100000,
        0b001000000100100100010,
        0b101100000100101100010,
    */
    /*  测试
            0b101100000000000000000
        ,{
            0b101100000000000000000,
            0b001100000000000000000,
            0b100100000000000000000,
            0b000100000000000000000,
            0b000000000000000000000,
        }
    */

    finder.multi_thread_find_score();
    finder.show_results(final_results, 1, 13, my_scene, 1000, 9);
    finder.output_csv("output.csv", final_results);
}
// 展示出怪
void show(uint32_t seed,uint32_t level_num,bool use_rng){
    BasicSeedFinder tmp;
    tmp.show_list(seed,1,13,my_scene,1000,level_num,use_rng);
}


int main(){
    test_set();
    // level_analysis();
    // test_kmp();
    // test_continue();
    // test_score(); 

    return 0;
}